{
    "tags": [
        {
            "id": 1,
            "name": "Django"
        },
        {
            "id": 2,
            "name": "Docker"
        },
        {
            "id": 3,
            "name": "Python"
        },
        {
            "id": 4,
            "name": "NLP"
        },
        {
            "id": 5,
            "name": "Machine Learning"
        },
        {
            "id": 6,
            "name": "OCaml"
        }
    ],
    "projects": [
        {
            "id": 1,
            "title_en": "This website",
            "description_en": "A modern portfolio website using Django, a Python-based web framework. The portfolio site showcase my work, skills, achievements, and contact information in an organized and visually appealing way. Tools used for the deployment of the app are a VPS, docker and nginx.",
            "title_fr": "Ce site",
            "description_fr": "Un site portfolio se basant sur Django, un framework Python. Ce site est là pour présenter mon travail, mes compétences, mes réalisations sans oublier un moyen de prendre contact avec moi. Les outils utilisés pour le déploiement sont un VPS, docker ainsi que nginx.",
            "github_url": "https://github.com/XeroBis/portfolio",
            "tags": [
                1,
                2,
                3
            ]
        },
        {
            "id": 2,
            "title_en": "IRC Chat",
            "description_en": "A multi-threaded IRC chat application implemented in Python. Two implementations are available:     \r\n- multi server\r\n- single server\r\nFor each implementation there is a client-side code that allows users to connect to the server, join channels, and send messages and there is a server-side code capable of handling multiple clients and servers.",
            "title_fr": "IRC Chat",
            "description_fr": "Une application de chat IRC, implémenté en Python. Deux implémentations sont disponibles :\r\n- serveurs multiples\r\n- serveur unique\r\nPour chaque implémentation, il existe un code côté client qui permet aux utilisateurs de se connecter au serveur, de rejoindre des canaux et d'envoyer des messages et il existe un code côté serveur capable de gérer plusieurs clients et serveurs.",
            "github_url": "https://github.com/XeroBis/irc_chat",
            "tags": [
                3
            ]
        },
        {
            "id": 3,
            "title_en": "Financial Sentiment Analysis",
            "description_en": "This project offers a comprehensive toolkit for analyzing sentiments within financial text data. Leveraging state-of-the-art natural language processing (NLP) techniques, machine learning algorithms and LMs fine tuning, our project provides insights into the sentiment dynamics of financial phrases.",
            "title_fr": "Analyse de sentiment financier",
            "description_fr": "Ce projet propose une boîte à outils pour analyser les sentiments au sein de données textuelles financières. En exploitant des techniques de NLP, de machine learning ainsi que du fine tuning de language models, il fournit des informations sur la dynamique des sentiments des phrases financières.",
            "github_url": "https://github.com/XeroBis/financial_sentiment_analysis",
            "tags": [
                3,
                4,
                5
            ]
        },
        {
            "id": 4,
            "title_en": "Native Language Detection",
            "description_en": "We obtained an algorithm that allows us to determine a person's native language from a text written in English with an accuracy of around 80%. The project was coded in Python and uses NLP and machine learning algorithms.",
            "title_fr": "Détection de langue maternelle",
            "description_fr": "Nous avons obtenu un algorithme qui permet de déterminer la langue maternelle d'une personnes à partir d'un texte écris en anglais avec une précision d’environ 80%. Le projet a été codé en Python et utilise des algorithmes de NLP et de machine learning.",
            "github_url": "https://github.com/XeroBis/lang_detection",
            "tags": [
                3,
                4,
                5
            ]
        },
        {
            "id": 5,
            "title_en": "Game Of Life",
            "description_en": "This project is an implementation of Conway's Game of Life, a cellular automaton devised by the British mathematician John Horton Conway. The game is a zero-player game, meaning that its evolution is determined by its initial state, requiring no further input. The project was coded in OCaml and Python. Both version are very different and have different features.",
            "title_fr": "Jeu de la vie",
            "description_fr": "Ce projet est une implémentation du jeu de la vie de Conway, un automate cellulaire conçu par le mathématicien britannique John Horton Conway. Le jeu est un jeu à zéro joueur, ce qui signifie que son évolution est déterminée par son état initial, ne nécessitant aucune autre saisie.  Le projet a été codé en OCaml et Python. Les deux versions sont très différentes et proposent différentes fonctionnalités.",
            "github_url": "https://github.com/XeroBis/Game-Of-Life",
            "tags": [
                3,
                6
            ]
        },
        {
            "id": 6,
            "title_en": "Basic Autograd implementation",
            "description_en": "Basic implementation of autograd in Python. This project was created to understand how autograd and neural network basic functionnality works. I followed the tutorial of Andrej Karpathy.",
            "title_fr": "Basic Autograd implementation",
            "description_fr": "Implémentation basique d'un autograd en Python. Ce projet a été créé pour comprendre comment fonctionnent les fonctionnalités de base de l'autograd et des réseaux neuronaux. J'ai suivi le tutoriel d'Andrej Karpathy.",
            "github_url": "https://github.com/XeroBis/nn_grad_basic",
            "tags": [
                3
            ]
        },
        {
            "id": 7,
            "title_en": "RL game agent",
            "description_en": "Basic implementation of a reinforcement learning system. Can serve as a basis for developing algorithms with a more precise scope of action.",
            "title_fr": "RL game agent",
            "description_fr": "Implémentation basique d'un système d'apprentissage par renforcement. Pourra servir de base pour le développement d'algorithme avec un champ d'action plus précis.",
            "github_url": "https://github.com/XeroBis/RL-Game-Agent",
            "tags": [
                3,
                5
            ]
        }
    ],
    "testimonials": [
        {
            "id": 1,
            "author": "Valentin",
            "text_en": "Someone serious and efficient in what he does!",
            "text_fr": "Quelqu'un de sérieux et d'efficace dans ce qu'il fait !"
        },
        {
            "id": 2,
            "author": "Julien",
            "text_en": "Always willing and with a smile, Alan has the soul of the ideal colleague.",
            "text_fr": "Toujours volontaire et avec le sourire, Alan a l'âme du collègue idéal."
        },
        {
            "id": 3,
            "author": "Antoine",
            "text_en": "Alan is a valuable asset to a team, with an eye for detail and a job well done.",
            "text_fr": "Alan est un précieux atout au sein d’une équipe, avec un souci du détail et du travail bien fait."
        },
        {
            "id": 4,
            "author": "Amaury",
            "text_en": "Alan is a dynamic and reliable person. He has skills and knowledge that he readily shares with others. I know I can trust him.",
            "text_fr": "Alan est une personne dynamique, toujours fiable. Il a des compétences et connaissances qu’il mets sans hésitation à la disposition des autres. Je sais que je peux lui faire confiance."
        }
    ]
}